from constellationPy import ClientSync

from எண்ணிக்கை.மாறிலிகள் import தானியங்கி_குழு_அடையாளம்
from தகவல்கள் import தகவல்_மூலம்


def எண்ணிக்கை_வடிவூட்டத்துக்கு(தகவல்கள்) -> dict:
    return தகவல்கள்


class விண்மீன்_தகவல்கள்(தகவல்_மூலம்):

    def __init__(
            தன்,
            விண்மீன்: ClientSync,
            குழு_அடையாளம்=தானியங்கி_குழு_அடையாளம்,
    ):
        super().__init__()
        தன்.விண்மீன் = விண்மீன்
        தன்.குழு_அடையாளம் = குழு_அடையாளம்

        தன்.தகவல்கள் = தன்.விண்மீன்.nuées.suivre_données_exportation(
            idNuée=தன்.குழு_அடையாளம்,
            langues=None,
        )

    def தகவல்களைப்_பெறு(தன்) -> dict:
        return எண்ணிக்கை_வடிவூட்டத்துக்கு(தன்.தகவல்கள்)
