தகவல்கள்="""{

  "latin": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "latn",

    "குறிகள்": "0123456789",

    "அடுக்குக்குறி": "eE",

    "பிரிப்பு": "."

  },

  "Mayab'": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": null,

    "குறிகள்": "𝋠𝋡𝋢𝋣𝋤𝋥𝋦𝋧𝋨𝋩𝋪𝋫𝋬𝋭𝋮𝋯𝋰𝋱𝋲𝋳"

  },

  "देवनागरी": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "deva",

    "அடுக்குக்குறி": "घा",

    "குறிகள்": "०१२३४५६७८९"

  },

  "ਪੰਜਾਬੀ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "guru",

    "அடுக்குக்குறி": "ਘਾ",

    "குறிகள்": "੦੧੨੩੪੫੬੭੮੯"

  },

  "ગુજરાતી": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "gujr",

    "குறிகள்": "૦૧૨૩૪૫૬૭૮૯"

  },

  "മലയാളം സ്ഥാനിക": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "mlym",

    "குறிகள்": "൦൧൨൩൪൫൬൭൮൯"

  },

  "മലയാളം": {

    "வகை": "அடிமானம்",

    "ஒருங்குறி": null,

    "குறிகள்": "൦൧൨൩൪൫൬൭൮൯",

    "அடிமானங்கள்": {

      "൰": 10,

      "൱": 100,

      "൲": 1000

    }

  },

  "தமிழ்": {

    "வகை": "அடிமானம்",

    "ஒருங்குறி": "taml",

    "குறிகள்": "௦௧௨௩௪௫௬௭௮௯",

    "அடுக்குக்குறி": "ப",

    "அடிமானங்கள்": {

      "௰": 10,

      "௱": 100,

      "௲": 1000

    }

  },

  "தமிழ் இடஞ்சார்": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "tamldec",

    "அடுக்குக்குறி": "ப",

    "குறிகள்": "௦௧௨௩௪௫௬௭௮௯"

  },

  "فارسی": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "arabext",

    "அடுக்குக்குறி": "ت",

    "குறிகள்": "۰۱۲۳۴۵۶۷۸۹",

    "பிரிப்பு": "٫."

  },

  "عربية": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "arab",

    "அடுக்குக்குறி": "ر",

    "குறிகள்": "٠١٢٣٤٥٦٧٨٩",

    "பிரிப்பு": "٫."

  },

  "ଓଡ଼ିଆ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "orya",

    "குறிகள்": "୦୧୨୩୪୫୬୭୮୯"

  },

  "বাংলা": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "beng",

    "அடுக்குக்குறி": "সূ",

    "குறிகள்": "০১২৩৪৫৬৭৮৯"

  },

  "ಕನ್ನಡ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "knda",

    "குறிகள்": "೦೧೨೩೪೫೬೭೮೯"

  },

  "తెలుగు": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "telu",

    "குறிகள்": "౦౧౨౩౪౫౬౭౮౯"

  },

  "𑀩𑁆𑀭𑀸𑀳𑀫𑀻": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "brah",

    "குறிகள்": "𑁦𑁧𑁨𑁩𑁪𑁫𑁬𑁭𑁮𑁯"

  },

  "𑄃𑄧𑄏": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "cakm",

    "குறிகள்": "𑄶𑄷𑄸𑄹𑄺𑄻𑄼𑄽𑄾𑄿"

  },

  "ߒߞߏ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "nkoo",

    "குறிகள்": "߀߁߂߃߄߅߆߇߈߉"

  },

  "ꢱꣃꢬꢵꢰ꣄ꢜ꣄ꢬ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "saur",

    "குறிகள்": "꣐꣑꣒꣓꣔꣕꣖꣗꣘꣙"

  },

  "ᱚᱞ ᱪᱤᱠᱤ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "olck",

    "குறிகள்": "᱐᱑᱒᱓᱔᱕᱖᱗᱘᱙"

  },

  "සිංහල ස්ථානීය": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "sinh",

    "குறிகள்": "෦෧෨෩෪෫෬෭෮෯"

  },

  "සිංහල": {

    "வகை": "அடிமானம்",

    "ஒருங்குறி": null,

    "குறிகள்": "෦෧෨෩෪෫෬෭෮෯",

    "அடிமானங்கள்": {

      "𑇫": 10,

      "𑇳": 100,

      "𑇴": 1000

    }

  },

  "ᬩᬮᬶ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "bali",

    "குறிகள்": "᭐᭑᭒᭓᭔᭕᭖᭗᭘᭙"

  },

  "ꨌꨩꨠ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "cham",

    "குறிகள்": "꩐꩑꩒꩓꩔꩕꩖꩗꩘꩙"

  },

  "ꦗꦮ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "java",

    "குறிகள்": "꧐꧑꧒꧓꧔꧕꧖꧗꧘꧙"

  },

  "ไทย": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "thai",

    "அடுக்குக்குறி": "กา",

    "குறிகள்": "๐๑๒๓๔๕๖๗๘๙"

  },

  "ລາວ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "laoo",

    "குறிகள்": "໐໑໒໓໔໕໖໗໘໙"

  },

  "བོད་ཡིག": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "tibt",

    "குறிகள்": "༠༡༢༣༤༥༦༧༨༩"

  },

  "လိၵ်ႈတႆး": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "mymrshan",

    "குறிகள்": "႐႑႒႓႔႕႖႗႘႙"

  },

  "တိုင်းလိုင်": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "mymrtlng",

    "குறிகள்": "꧰꧱꧲꧳꧴꧵꧶꧷꧸꧹"

  },

  "မြန်မာ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "mymr",

    "குறிகள்": "၀၁၂၃၄၅၆၇၈၉"

  },

  "ꤊꤢ꤬ꤛꤢ꤭ ꤜꤟꤤ꤬": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "kali",

    "குறிகள்": "꤀꤁꤂꤃꤄꤅꤆꤇꤈꤉"

  },

  "ᨣᩴᩣᩱᨴᩭ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "talu",

    "குறிகள்": "᧐᧑᧒᧓᧔᧕᧖᧗᧘᧙"

  },

  "𑜒𑜑𑜪𑜨": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "ahom",

    "குறிகள்": "𑜰𑜱𑜲𑜳𑜴𑜵𑜶𑜷𑜸𑜹"

  },

  "𑰥𑰹𑰎𑰿𑰬𑰲𑰎𑰱": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "bhks",

    "குறிகள்": "𑱐𑱑𑱒𑱓𑱔𑱕𑱖𑱗𑱘𑱙"

  },

  "𑵶𑶓𑶕𑶂𑶋": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "gong",

    "குறிகள்": "𑶠𑶡𑶢𑶣𑶤𑶥𑶦𑶧𑶨𑶩"

  },

  "𑴎𑴽𑵀𑴘𑴲": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "gonm",

    "குறிகள்": "𑵐𑵑𑵒𑵓𑵔𑵕𑵖𑵗𑵘𑵙"

  },

  "𐴇𐴝𐴕𐴞𐴉𐴞": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "rohg",

    "குறிகள்": "𐴰𐴱𐴲𐴳𐴴𐴵𐴶𐴷𐴸𐴹"

  },

  "𖬖𖬰𖬝𖬵 𖬄𖬶𖬟 𖬌𖬣𖬵": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "hmng",

    "குறிகள்": "𖭐𖭑𖭒𖭓𖭔𖭕𖭖𖭗𖭘𖭙"

  },

  "𞄀𞄩𞄰𞄁𞄦𞄱𞄂𞄤𞄳𞄬𞄃𞄥𞄳": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "hmng",

    "குறிகள்": "𞅀𞅁𞅂𞅃𞅄𞅅𞅆𞅇𞅈𞅉"

  },

  "ខ្មែរ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "khmr",

    "குறிகள்": "០១២៣៤៥៦៧៨៩"

  },

  "ᨲ᩠ᩅᩫᨾᩮᩥᩬᨦ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "lana",

    "குறிகள்": "᪀᪁᪂᪃᪄᪅᪆᪇᪈᪉"

  },

  "ᰴᰩᰛᰴᰧᰛ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "lepc",

    "குறிகள்": "᱀᱁᱂᱃᱄᱅᱆᱇᱈᱉"

  },

  "ᤕᤠᤰᤌᤢᤱ ᤐᤠᤴ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "limb",

    "குறிகள்": "᥆᥇᥈᥉᥊᥋᥌᥍᥎᥏"

  },

  "ᠮᠣᠩᠭᠣᠯ ᠬᠡᠯᠡ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "mong",

    "குறிகள்": "᠐᠑᠒᠓᠔᠕᠖᠗᠘᠙"

  },

  "ꯃꯤꯇꯩ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "mtei",

    "குறிகள்": "꯰꯱꯲꯳꯴꯵꯶꯷꯸꯹"

  },

  "ᮞᮥᮔ᮪ᮓ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "sund",

    "குறிகள்": "᮰᮱᮲᮳᮴᮵᮶᮷᮸᮹"

  },

  "𑋝𑋡𑋟𑋐𑋢": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "sind",

    "குறிகள்": "𑋰𑋱𑋲𑋳𑋴𑋵𑋶𑋷𑋸𑋹"

  },

  "𑘦𑘻𑘚𑘲": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "modi",

    "குறிகள்": "𑙐𑙑𑙒𑙓𑙔𑙕𑙖𑙗𑙘𑙙"

  },

  "𖩃𖩓𖩑": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "mroo",

    "குறிகள்": "𖩠𖩡𖩢𖩣𖩤𖩥𖩦𖩧𖩨𖩩"

  },

  "𑐥𑑂𑐬𑐔𑐮𑐶𑐟 𑐣𑐾𑐥𑐵𑐮": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "newa",

    "குறிகள்": "𑑐𑑑𑑒𑑓𑑔𑑕𑑖𑑗𑑘𑑙"

  },

  "ꕙꔤ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "vaii",

    "குறிகள்": "꘠꘡꘢꘣꘤꘥꘦꘧꘨꘩"

  },

  "𐒋𐒘𐒈𐒑𐒛𐒒𐒕𐒀": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "osma",

    "குறிகள்": "𐒠𐒡𐒢𐒣𐒤𐒥𐒦𐒧𐒨𐒩"

  },

  "𑆯𑆳𑆫𑆢𑆳": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "shrd",

    "குறிகள்": "𑇐𑇑𑇒𑇓𑇔𑇕𑇖𑇗𑇘𑇙"

  },

  "ግዕዝ": {

    "வகை": "அடிமானம்",

    "ஒருங்குறி": "ethi",

    "குறிகள்": "0፩፪፫፬፭፮፯፰፱",

    "அடிமானங்கள்": {

      "፲": 10,

      "፳": 20,

      "፴": 30,

      "፵": 40,

      "፶": 50,

      "፷": 60,

      "፸": 70,

      "፹": 80,

      "፺": 90,

      "፻": 100,

      "፼": 10000

    }

  },

  "𑃐𑃦𑃝𑃗 𑃐𑃦𑃖𑃛𑃣𑃗": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "sora",

    "குறிகள்": "𑃰𑃱𑃲𑃳𑃴𑃵𑃶𑃷𑃸𑃹"

  },

  "𑚔𑚭𑚊𑚤𑚯": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "takr",

    "குறிகள்": "𑛀𑛁𑛂𑛃𑛄𑛅𑛆𑛇𑛈𑛉"

  },

  "𑒞𑒱𑒩𑒯𑒳𑒞𑒰": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "tirh",

    "குறிகள்": "𑓐𑓑𑓒𑓓𑓔𑓕𑓖𑓗𑓘𑓙"

  },

  "𑢹𑣗𑣁𑣜𑣊 𑣏𑣂𑣕𑣂": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "wara",

    "குறிகள்": "𑣠𑣡𑣢𑣣𑣤𑣥𑣦𑣧𑣨𑣩"

  },

  "ꛀꛣꚧꚳ": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": null,

    "குறிகள்": "ꛯꛦꛧꛨꛩꛪꛫꛬꛭꛮ"

  },

  "": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "wcho",

    "குறிகள்": "𞋰𞋱𞋲𞋳𞋴𞋵𞋶𞋷𞋸𞋹"

  },

  "𞤀𞤣𞤤𞤥": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "adlm",

    "குறிகள்": "𞥐𞥑𞥒𞥓𞥔𞥕𞥖𞥗𞥘𞥙"

  },

  "汉语": {

    "வகை": "அடிமானம்",

    "ஒருங்குறி": "hans",

    "அடுக்குக்குறி": "幂",

    "குறிகள்": "〇一二三四五六七八九",

    "பிரிப்பு": "。.",

    "அடிமானங்கள்": {

      "十": 10,

      "百": 100,

      "千": 1000,

      "万": 10000,

      "亿": 1e8,

      "兆": 1e12,

      "京": 1e16,

      "垓": 1e20,

      "秭": 1e24,

      "穰": 1e28,

      "溝": 1e32,

      "澗": 1e36,

      "正": 1e40,

      "載": 1e44

    }

  },

  "进位汉语": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": "hanidec",

    "அடுக்குக்குறி": "幂",

    "குறிகள்": "〇一二三四五六七八九",

    "பிரிப்பு": "。."

  },

  "花碼": {

    "வகை": "இடஞ்சார்",

    "ஒருங்குறி": null,

    "குறிகள்": "〇〡〢〣〤〥〦〧〨〩"

  }

}"""