from typing import Optional

from nuchabäl import Nuchabäl

from .அடிமானம் import அடிமானம்
from .இடஞ்சார் import இடஞ்சார்
from .தகவல்கள்.இயல்புநிலை import இயல்புநிலை_தகவல்கள்
from .தகவல்கள்.தகவல்கள் import தகவல்_மூலம்
from .பிழைகள் import மொழிபெயர்ப்புபிழை


class எண்ணிக்கை(object):
    def __init__(தன், மொழிகள்: Optional[Nuchabäl] = None, தகவல்கள்: Optional[தகவல்_மூலம்] = None):
        தகவல்கள் = தகவல்கள் or இயல்புநிலை_தகவல்கள்()

        தன்.முறைமைகளை_உருவாக்கு(தகவல்கள்.தகவல்களைப்_பெறு())

        தன்.nchbl = மொழிகள் or Nuchabäl()

    def எண்ணுக்கு(தன், உரை: str, மொழி=None) -> int or float:
        முறைமைகள் = தன்.முறைமையைப்_பேறு(மொழி, எல்லாம்=True)

        for முறை in முறைமைகள்:
            if முறை.சரிபார்ப்பு(உரை):
                return முறை.எண்ணுக்கு(உரை)

        raise மொழிபெயர்ப்புபிழை(உரை)

    def உரைக்கு(தன், எண்: str or int or float, மொழி: str, மொழி_மூலம்: Optional[str] = None) -> str:
        முறைமை = தன்.முறைமையைப்_பேறு(மொழி)

        if isinstance(எண், str):
            எண் = தன்.எண்ணுக்கு(எண், மொழி=மொழி_மூலம்)

        return முறைமை.உரைக்கு(எண்)

    def சுருங்குறித்தொடர்(தன், மொழி: str) -> str:
        முறைமை = தன்.முறைமையைப்_பேறு(மொழி)
        return முறைமை.சுருங்குறித்தொடர்()

    def முறைமைகளை_உருவாக்கு(தன், தகவட்கள்):
        முறைமைகள் = {}
        for பெயர், விவரங்கள் in தகவட்கள்.items():

            வகை = விவரங்கள்['வகை']
            ஒருங்குறி = விவரங்கள்['ஒருங்குறி'] if "ஒருங்குறி" in விவரங்கள் else None
            பிரிப்பு = விவரங்கள்['பிரிப்பு'] if 'பிரிப்பு' in விவரங்கள் else '.'
            அடுக்குக்குறி = விவரங்கள்['அடுக்குக்குறி'] if 'அடுக்குக்குறி' in விவரங்கள் else 'e'
            குறிகள் = விவரங்கள்['குறிகள்']

            if வகை == 'இடஞ்சார்':
                முறைமைகள்[பெயர்] = இடஞ்சார்(
                    பெயர், ஒருங்குறி=ஒருங்குறி, குறிகள்=குறிகள், பிரிப்பு=பிரிப்பு, அடுக்குக்குறி=அடுக்குக்குறி
                )
            elif வகை == 'அடிமானம்':
                அடிமானங்கள் = விவரங்கள்['அடிமானங்கள்']
                முறைமைகள்[பெயர்] = அடிமானம்(
                    பெயர், ஒருங்குறி=ஒருங்குறி, அடிமானங்கள்=அடிமானங்கள், குறிகள்=குறிகள், பிரிப்பு=பிரிப்பு,
                    அடுக்குக்குறி=அடுக்குக்குறி
                )
            else:
                raise ValueError(வகை)
        தன்.முறைமைகள் = முறைமைகள்

    def முறைமையைப்_பேறு(தன், மொழி: str, எல்லாம்=False):
        சாத்தியங்கள் = list(தன்.முறைமைகள்.values()) if மொழி is None else []
        if not சாத்தியங்கள் and மொழி in தன்.முறைமைகள்:
            சாத்தியங்கள் = [தன்.முறைமைகள்[மொழி]]
        if not சாத்தியங்கள்:
            சாத்தியங்கள் = [மு for மு in தன்.முறைமைகள்.values() if மு.ஒருங்குறி == மொழி]

        if not சாத்தியங்கள்:
            try:
                மொழி = தன்.nchbl.rajilanïkChabäl(மொழி)
            except ValueError:
                pass

        if not சாத்தியங்கள்:
            raise ValueError(மொழி)

        if எல்லாம்:
            return சாத்தியங்கள்
        else:
            return சாத்தியங்கள்[0]
