from .பிழைகள் import மொழிபெயர்ப்புபிழை
from .முறைமைகள் import முறைமை_பேற்ற


def எண்ணுக்கு(உரை, மொழி=None):
    முறைமைகள் = முறைமை_பேற்ற(மொழி, எல்லாம்=True)

    for முறை in முறைமைகள்:
        if முறை.சரிபார்ப்பு(உரை):
            return முறை.எண்ணுக்கு(உரை)

    raise மொழிபெயர்ப்புபிழை(உரை)


def உரைக்கு(எண், மொழி, மொழி_மூலம்=None):
    முறைமை = முறைமை_பேற்ற(மொழி)

    if isinstance(எண், str):
        எண் = எண்ணுக்கு(எண், மொழி=மொழி_மூலம்)

    return முறைமை.உரைக்கு(எண்)


def அறிவியல்குறியீடு(எண், மொழி, மொழி_மூலம்=None):
    pass


def எண்ணெண்(எண், மொழி, மொழி_மூலம்=None):
    pass


def பதினறும(எண், மொழி, மொழி_மூலம்=None):
    pass


def இரும(எண், மொழி, மொழி_மூலம்=None):
    pass
