import re
import unittest

from எண்ணிக்கை0 import உரைக்கு, எண்ணுக்கு, முறைமைகள்

எண்கள் = {
    'ஓன்று': {'எண்': 1, 'latin': '1', 'ગુજરાતી': '૧', 'தமிழ்': '௧', "mayab'": '𝋡'},
    'பத்து': {'எண்': 10, 'latin': '10', 'ગુજરાતી': '૧૦', 'தமிழ்': '௰', "mayab'":  '𝋪'},
    'நூறு': {'எண்': 100, 'latin': '100', 'ગુજરાતી': '૧૦૦', 'தமிழ்': '௱', "mayab'": '𝋥𝋠'},
    'ஆயிரம்': {'எண்': 1000, 'latin': '1000', 'ગુજરાતી': '૧૦૦૦', 'தமிழ்': '௲', "mayab'": '𝋢𝋪𝋠'},
    'பத்தாயிறம்': {'எண்': 10000, 'latin': '10000', 'ગુજરાતી': '૧૦૦૦૦', 'தமிழ்': '௰௲', "mayab'": '𝋡𝋥𝋠𝋠'},
    'லச்சியம்': {'எண்': 100000, 'latin': '100000', 'ગુજરાતી': '૧૦૦૦૦૦', 'தமிழ்': '௱௲', "mayab'": '𝋬𝋪𝋠𝋠'},
    'கோடி': {'எண்': 10000000, 'latin': '10000000', 'ગુજરાતી': '૧૦૦૦૦૦૦૦', 'தமிழ்': '௰௲௲', "mayab'": '𝋣𝋢𝋪𝋠𝋠𝋠'},
    'முழு_எண்': {'எண்': 123, 'latin': '123', 'ગુજરાતી': '૧૨૩', 'தமிழ்': '௱௨௰௩', "mayab'": '𝋦𝋣'},
    'முழு_எண்_பதி': {'எண்': 123., 'latin': '123.', 'ગુજરાતી': '૧૨૩.', 'தமிழ்': '௱௨௰௩.',  "mayab'": '𝋦𝋣.'},
    'பதின்மம்': {'எண்': 0.123456789, 'latin': '0.123456789', 'ગુજરાતી': '૦.૧૨૩૪૫૬૭૮૯', 'தமிழ்': '௦.௧௨௩௪௫௬௭௮௯',  "mayab'": '𝋠.𝋢𝋩𝋧𝋭𝋡𝋮𝋩𝋲𝋨'},
    'பதின்மம்_ஆரம்பு': {'எண்': .123, 'latin': ',123', 'ગુજરાતી': '.૧૨૩', 'தமிழ்': '.௧௨௩',  "mayab'": '.𝋢𝋩𝋤'},
    'புதியம்_பதின்மம்_பல_புதியம்': {'எண்': 0.0000123, 'latin': '0.0000123', 'ગુજરાતી': '૦.૦૦૦૦૧૨૩', 'தமிழ்': '௦.௦௦௦௦௧௨௩',  "mayab'": '𝋠.𝋠𝋠𝋠𝋡𝋳𝋧𝋤'},
    'பதின்மம்_ஆரம்பு_பல_புதியம்': {'எண்': .0000123, 'latin': '.0000123', 'ગુજરાતી': '.૦૦૦૦૧૨૩', 'தமிழ்': '.௦௦௦௦௧௨௩',  "mayab'": '𝋠𝋠𝋠𝋡𝋳𝋧𝋤'},
    'பதின்மம்_பல_புதியம்': {'எண்': 12.0000123, 'latin': '12.0000123', 'ગુજરાતી': '૧૨.૦૦૦૦૧૨૩', 'தமிழ்': '௰௨.௦௦௦௦௧௨௩',  "mayab'": '𝋬.𝋠𝋠𝋠𝋡𝋳𝋧𝋤'},
    'எதிர்': {'எண்': -1.23, 'latin': '-1.23', 'ગુજરાતી': '-૧.૨૩', 'தமிழ்': '-௧.௨௩',  "mayab'": '-𝋡.𝋤𝋬'},
    'எதிர்_பதின்மம்_ஆரம்பு': {'எண்': -.101, 'latin': '-.101', 'ગુજરાતી': '-.૧૦૧', 'தமிழ்': '-.௧௦௧',  "mayab'": '-.𝋢𝋠𝋨'},
    'பெரிய என்': {'எண்': -1_2345_6789.00012345678900, 'latin': '-123456789.00012345678900', 'ગુજરાતી': '-૧૨૩૪૫૬૭૮૯.૦૦૦૧૨૩૪૫૬૭૮૯૦૦', 'தமிழ்': '-௧௨௲௩௱௪௰௫௬௲௭௱௮௰௯.௦௦௦௧௨௩௪௫௬௭௮௯௦௦',  "mayab'": '-'},
    'புஜியம்': {'எண்': 0, 'latin': '0', 'ગુજરાતી': '૦', 'தமிழ்': '௦', "mayab'": '𝋠'},
    'புஜியம்_பதின்மம்': {'எண்': 0., 'latin': '0.', 'ગુજરાતી': '૦.', 'தமிழ்': '௦.', "mayab'": '𝋠.'},
    'புஜியம்_பதின்மம்_புஜியம்': {'எண்': 0.0, 'latin': '0.0', 'ગુજરાતી': '૦.૦', 'தமிழ்': '௦.௦', "mayab'": '𝋠.𝋠'}
}
"""
12000000000000000.
chiffre à text
text à chiffre
text à text
"""


class Test_மாற்றம்(unittest.TestCase):

    def _எண்_பரிசோதனை(தன், எண், பயர்):

        for மொ in முறைமைகள்:
            with தன்.subTest(பயர், மொழி=மொ):
                உ = உரைக்கு(எண், மொ)
                எ = எண்ணுக்கு(உ)

                தன்.assertIsInstance(எ, type(எண்))
                தன்.assertEqual(எ, எண், உ)

    def test_மாற்றம்(தன்):
        for பயர், எண் in எண்கள்.items():
            தன்._எண்_பரிசோதனை(எண்[0], பயர்)


class Test_உரை_மூலம்_உரை(unittest.TestCase):
    def _உரை_பரிசோதனை(தன், உரை, பயர்):
        with தன்.subTest(பயர்):
            மொ_பெ = முறைமைகள்
            உரை_ = உரைக்கு(உரை, 'latin')

            for மொ in மொ_பெ:
                உரை_ = உரைக்கு(உரை_, மொ)

            தன்.assertEqual(எண்ணுக்கு(உரை_), எண்ணுக்கு(உரை))

    def test_உரை(தன்):
        for பயர், எண் in எண்கள்.items():
            தன்._உரை_பரிசோதனை(எண்[1], பயர்)


class Test_வழவெளி(unittest.TestCase):

    def _வழவெளி_பரிசோதனை(தன், எண், பயர்):

        for மொ in முறைமைகள்:
            with தன்.subTest(பயர், மொழி=மொ):
                உரை = உரைக்கு(எண், மொ)
                வழ = வழவெளி(மொ)
                குழு = re.fullmatch(வழ, உரை)
                தன்.assertIsNotNone(குழு)

    def test_வழவெளி(தன்):
        for பயர், எண் in எண்கள்.items():
            தன்._வழவெளி_பரிசோதனை(எண்[0], பயர்)
