import unittest
import re

from எண்ணிக்கை import உரைக்கு, எண்ணுக்கு, மொழிகள், வழவெளி


எண்கள் = {
    'முழு_எண்': (123, '123'),
    'முழு_எண்_பதி': (123., '123.'),
    'பதின்மம்': (0.123456789, '0.123456789'),
    'பதின்மம்_ஆரம்பு': (.123, '.123'),
    'புதியம்_பதின்மம்_பல_புதியம்': (0.0000123, '0.0000123'),
    'பதின்மம்_ஆரம்பு_பல_புதியம்': (.0000123, '.0000123'),
    'பதின்மம்_பல_புதியம்': (12.0000123, '12.0000123'),
    'எதிர்': (-1.23, '-1.23'),
    'எதிர்_பதின்மம்_ஆரம்பு': (-.101, '-.101'),
    'எல்லாம்': (-123456789.00012345678900, '-123456789.00012345678900'),
    'புஜியம்': (0, '0')
}


class Test_மாற்றம்(unittest.TestCase):

    def _எண்_பரிசோதனை(தன், எண், பயர்):

        for மொ in மொழிகள்():
            with தன்.subTest(பயர், மொழி=மொ):
                உ = உரைக்கு(எண், மொ, தளம்=False)
                உ_௨ = உரைக்கு(எண், மொ, தளம்=None)
                வே = எண்ணுக்கு(உ)
                வே_௨ = எண்ணுக்கு(உ_௨)

                தன்.assertIsInstance(வே, type(எண்))
                தன்.assertEqual(வே, எண், உ)
                if உ != உ_௨:
                    தன்.assertIsInstance(வே_௨, type(எண்))
                    தன்.assertEqual(வே_௨, எண், உ_௨)

    def test_மாற்றம்(தன்):
        for பயர், எண் in எண்கள்.items():
            தன்._எண்_பரிசோதனை(எண்[0], பயர்)


class Test_உரை_மூலம்_உரை(unittest.TestCase):
    def _உரை_பரிசோதனை(தன், உரை, பயர்):
        with தன்.subTest(பயர்):
            மொ_பெ = மொழிகள்()
            உரை_ = உரைக்கு(உரை, 'latin')

            for மொ in மொ_பெ:
                உரை_ = உரைக்கு(உரை_, மொ)

            தன்.assertEqual(எண்ணுக்கு(உரை_), எண்ணுக்கு(உரை))

    def test_உரை(தன்):
        for பயர், எண் in எண்கள்.items():
            தன்._உரை_பரிசோதனை(எண்[1], பயர்)


class Test_வழவெளி(unittest.TestCase):

    def _வழவெளி_பரிசோதனை(தன், எண், பயர்):

        for மொ in மொழிகள்():
            with தன்.subTest(பயர், மொழி=மொ):
                உரை = உரைக்கு(எண், மொ)
                வழ = வழவெளி(மொ)
                குழு = re.fullmatch(வழ, உரை)
                தன்.assertIsNotNone(குழு)

    def test_வழவெளி(தன்):
        for பயர், எண் in எண்கள்.items():
            தன்._வழவெளி_பரிசோதனை(எண்[0], பயர்)
